# 💻 Б6: Пронаоѓање на сите CDS

```{admonition} Опис на барање
:class: tip
Со помош на **BioPython**, пронајдете ги секвенциите на
различните кодни региони означени како (CDS). **CDS** се
регионите добиени после процедурата на отсекување на
интроните.
```

from Bio import SeqIO
gene_record = SeqIO.read("yersinia-pestis-fasta/NC_005816.gb", "genbank")

Вкупната должина на ДНА секвенцата е: 

print(len(gene_record.seq))

Додека нас не интересира елементот од <code>gene_record.features</code>, кој е листа од карактеристики од големо значење за описот на самата секвенца. Откако ќе се започне со користење на овие секвенци, ова е еден вид на организација што лесно ни озвозможува да добиеме "поапстрактна" информација што се знае за самата секвенца. 

Вкупниот број на овие features може да го добиеме со: 

print(len(gene_record.features))

Секој еден feature има неколку атрибути, како на пример првиот од листата гледаме дека има повеќе променливи кои го опишваат меѓу кои најбитни се: 

- <code>.type:</code> типот на карактеристика ("CDS", "gene", ..) 
- <code>.location:</code> локација на самата секвенца, како вид мапирање (почеток:крај)

dir(gene_record.features[0])

Пример од книгата, и интересен CDS е "<code>pim</code>" генот, YP_pPCP05 кој се наоѓа во секвенцата меѓу базните парови [4342:4780]: 

print(gene_record.features[21])

Но, ние треба да ги најдее сите вакви CDS кодони и ова може да го направиме со тоа што ќе бараме низ целата низа од 41 features каде се наоѓаат оние кои имаат тип "CDS":

CDS_list = []

for i in range(0, len(gene_record.features)):
    if gene_record.features[i].type == "CDS":
        CDS_list.append(i)

print(f"Број на пронајдени CDS: {len(CDS_list)}")

Вакви гледаме дека се вкупно 10, и нив можеме да ги испринтаме:

for i in CDS_list:
    print(gene_record.features[i])